sorosaulong-ux/gd32-test-project/Library/gd32a7xx_syscfg.c
/*!
    \file    gd32a7xx_syscfg.c
    \brief   SYSCFG driver

    \version 2025-08-06, V0.1.0, firmware for GD32A7xx
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32a7xx_syscfg.h"

/*!
    \brief      reset the SYSCFG registers, API ID: 0x0001
    \param[in]  none
    \param[out] none
    \retval     none
*/
void syscfg_deinit(void)
{
    SYSCFG_PMCFG        = 0U;
    SYSCFG_EXTISS0      = 0U;
    SYSCFG_EXTISS1      = 0U;
    SYSCFG_EXTISS2      = 0U;
    SYSCFG_EXTISS3      = 0U;
    SYSCFG_STAT         = 8U;
    SYSCFG_CFG          = 0x00280028U;
    SYSCFG_TIMERBKINSEL = 0U;
    SYSCFG_CPU0CS = 0x20U;
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
    SYSCFG_CPU1CS = 0x20U;
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
    SYSCFG_SRAMCFG     = 0U;
    SYSCFG_RMCFG       = 0U;
    SYSCFG_TIMER0CFG0  = 0U;
    SYSCFG_TIMER0CFG1  = 0U;
    SYSCFG_TIMER0CFG2  = 0U;
    SYSCFG_TIMER1CFG0  = 0U;
    SYSCFG_TIMER1CFG1  = 0U;
    SYSCFG_TIMER1CFG2  = 0U;
    SYSCFG_TIMER2CFG0  = 0U;
    SYSCFG_TIMER2CFG1  = 0U;
    SYSCFG_TIMER2CFG2  = 0U;
    SYSCFG_TIMER7CFG0  = 0U;
    SYSCFG_TIMER7CFG1  = 0U;
    SYSCFG_TIMER7CFG2  = 0U;
    SYSCFG_TIMER19CFG0 = 0U;
    SYSCFG_TIMER19CFG1 = 0U;
    SYSCFG_TIMER19CFG2 = 0U;
    SYSCFG_TIMER20CFG0 = 0U;
    SYSCFG_TIMER20CFG1 = 0U;
    SYSCFG_TIMER20CFG2 = 0U;
    SYSCFG_TIMER60CFG0 = 0U;
    SYSCFG_TIMER60CFG1 = 0U;
    SYSCFG_TIMER60CFG2 = 0U;
    SYSCFG_TIMER61CFG0 = 0U;
    SYSCFG_TIMER61CFG1 = 0U;
    SYSCFG_TIMER61CFG2 = 0U;
    SYSCFG_TIMER62CFG0 = 0U;
    SYSCFG_TIMER62CFG1 = 0U;
    SYSCFG_TIMER62CFG2 = 0U;
    SYSCFG_TIMER63CFG0 = 0U;
    SYSCFG_TIMER63CFG1 = 0U;
    SYSCFG_TIMER63CFG2 = 0U;
#if defined (GD32A72XX) || defined (GD32A74XX)
    SYSCFG_IRCP0INTSTAT0 = 0x3U;
    SYSCFG_IRCP0INTSTAT1 = 0x3U;
    SYSCFG_IRCP0INTSTAT2 = 0x3U;
    SYSCFG_IRCP0INTSTAT3 = 0x3U;
    SYSCFG_IRCP1INTSTAT0 = 0x3U;
    SYSCFG_IRCP1INTSTAT1 = 0x3U;
    SYSCFG_IRCP1INTSTAT2 = 0x3U;
    SYSCFG_IRCP1INTSTAT3 = 0x3U;
    SYSCFG_IRCP0INT0     = 0U;
    SYSCFG_IRCP0INT1     = 0U;
    SYSCFG_IRCP0INT2     = 0U;
    SYSCFG_IRCP0INT3     = 0U;
    SYSCFG_IRCP1INT0     = 0U;
    SYSCFG_IRCP1INT1     = 0U;
    SYSCFG_IRCP1INT2     = 0U;
    SYSCFG_IRCP1INT3     = 0U;
    SYSCFG_IRCPUCTL      = 0U;
#endif /* defined (GD32A72XX) || defined (GD32A74XX) */
    SYSCFG_MEMAEXCTL = 0U;
    SYSCFG_BM1EDCEN  = 0U;
    SYSCFG_BM2EDCEN  = 0U;
    SYSCFG_BUSCHKCFG = 0U;
    SYSCFG_TMRFCS    = 0xF0000U;
    rcu_periph_reset_enable(RCU_SYSCFGRST);
    rcu_periph_reset_disable(RCU_SYSCFGRST);
}

/*!
    \brief      configure the GPIO pin as EXTI line, API ID: 0x0002
    \param[in]  exti_port: specify the gpio port used in EXTI
                only one parameter can be selected which is shown as below:
      \arg        EXTI_SOURCE_GPIOx(x = A,B,C..N): EXTI gpio port
    \param[in]  exti_pin: specify the EXTI line
                only one parameter can be selected which is shown as below:
      \arg        EXTI_SOURCE_PINx(for GPIOA\GPIOB\GPIOC\GPIOD\GPIOE\GPIOF\GPIOG\GPIOH\GPIOI\GPIOJ\
                                       GPIOK\GPIOL\GPIOM, x = 0..15, for GPION, x = 0..11): EXTI GPIO pin
    \param[out] none
    \retval     none
*/
void syscfg_exti_line_config(uint8_t exti_port, uint8_t exti_pin)
{
    uint32_t clear_exti_mask = ~((uint32_t)EXTI_SS_MASK << (EXTI_SS_MSTEP(exti_pin)));
    uint32_t config_exti_mask = ((uint32_t)exti_port) << (EXTI_SS_MSTEP(exti_pin));

#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_EXTI_SOURCE_GPIO(exti_port)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(5), ERR_PARAM_INVALID);
    } else if(NOT_EXTI_SOURCE_PIN(exti_pin) && (exti_port != EXTI_SOURCE_GPION)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(5), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch(exti_pin / EXTI_SS_JSTEP) {
        case EXTISS0:
            /* clear EXTI source line(0..3) */
            SYSCFG_EXTISS0 &= clear_exti_mask;
            /* configure EXTI source line(0..3) */
            SYSCFG_EXTISS0 |= config_exti_mask;
            break;
        case EXTISS1:
            /* clear EXTI source line(4..7) */
            SYSCFG_EXTISS1 &= clear_exti_mask;
            /* configure EXTI source line(4..7) */
            SYSCFG_EXTISS1 |= config_exti_mask;
            break;
        case EXTISS2:
            /* clear EXTI source line(8..11) */
            SYSCFG_EXTISS2 &= clear_exti_mask;
            /* configure EXTI source line(8..11) */
            SYSCFG_EXTISS2 |= config_exti_mask;
            break;
        case EXTISS3:
            /* clear EXTI source line(12..15) */
            SYSCFG_EXTISS3 &= clear_exti_mask;
            /* configure EXTI source line(12..15) */
            SYSCFG_EXTISS3 |= config_exti_mask;
            break;
        default:
            break;
        }
    }
}

/*!
    \brief      enable I2Cx(x=0,1) fast mode plus, API ID: 0x0003
    \param[in]  i2c_fmp
                one or more parameters can be selected which are shown as below:
      \arg        SYSCFG_I2C0_FMP: I2C0 fast mode plus
      \arg        SYSCFG_I2C1_FMP: I2C1 fast mode plus
    \param[out] none
    \retval     none
*/
void syscfg_i2c_fast_mode_plus_enable(uint32_t i2c_fmp)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SYSCFG_I2C_FMP(i2c_fmp)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(3), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        SYSCFG_PMCFG |= i2c_fmp;
    }
}

/*!
    \brief      disable I2Cx(x=0,1) fast mode plus, API ID: 0x0004
    \param[in]  i2c_fmp
                one or more parameters can be selected which are shown as below:
      \arg        SYSCFG_I2C0_FMP: I2C0 fast mode plus
      \arg        SYSCFG_I2C1_FMP: I2C1 fast mode plus
    \param[out] none
    \retval     none
*/
void syscfg_i2c_fast_mode_plus_disable(uint32_t i2c_fmp)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SYSCFG_I2C_FMP(i2c_fmp)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(4), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        SYSCFG_PMCFG &= ~i2c_fmp;
    }
}

/*!
    \brief      enable the tx EVENTOUT from CM_x, API ID: 0x0006
    \param[in]  core_txeven
                one or more parameters can be selected which are shown as below:
      \arg        CORE_TX_EVENTOUT_CM7_0: Cortex-M7 core 0(CM7_0) TX EVENTOUT
      \arg        CORE_TX_EVENTOUT_CM7_1: Cortex-M7 core 1(CM7_1) TX EVENTOUT
      \arg        CORE_TX_EVENTOUT_CM23: Cortex-M23 core(CM23 HSM) TX EVENTOUT
    \param[out] none
    \retval     none
*/
void syscfg_tx_eventout_enable(uint32_t core_txeven)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_CORE_TX_EVENTOUT_CM(core_txeven)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(6), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        SYSCFG_CFG |= (uint32_t)core_txeven;
    }
}

/*!
    \brief      disable the tx EVENTOUT from CM_x, API ID: 0x0007
    \param[in]  core_txeven
                one or more parameters can be selected which are shown as below:
      \arg        CORE_TX_EVENTOUT_CM7_0: Cortex-M7 core 0(CM7_0) TX EVENTOUT
      \arg        CORE_TX_EVENTOUT_CM7_1: Cortex-M7 core 1(CM7_1) TX EVENTOUT
      \arg        CORE_TX_EVENTOUT_CM23: Cortex-M23 core(CM23 HSM) TX EVENTOUT
    \param[out] none
    \retval     none
*/
void syscfg_tx_eventout_disable(uint32_t core_txeven)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_CORE_TX_EVENTOUT_CM(core_txeven)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(7), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        SYSCFG_CFG &= ~(uint32_t)core_txeven;
    }
}

/*!
    \brief      select TRIGSEL or GPIO as TIMER break input source, API ID: 0x0008
    \param[in]  timer_bkin
                one or more parameters can be selected which are shown as below:
      \arg        TIMERx_BRKINy_TRIG (x=0,7,19,20,60,61,62,63 y=0,1,2,3):TIMERx break input y source
    \param[in]  source_sel
                only one parameter can be selected which are shown as below:
      \arg        TIMER_BRKIN_SEL_GPIO: TIMER break input select from GPIO pin
      \arg        TIMER_BRKIN_SEL_TRIGSEL: TIMER break input select from TRIGSEL
    \param[out] none
    \retval     none
*/
void syscfg_timer_bkin_select(uint32_t timer_bkin, uint32_t source_sel)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SYSCFG_TIMER_BKIN(timer_bkin)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(8), ERR_PARAM_INVALID);
    } else if(NOT_SYSCFG_TIMER_BRKIN_SEL(source_sel)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(8), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(TIMER_BRKIN_SEL_GPIO == source_sel) {
            /* select GPIO */
            SYSCFG_TIMERBKINSEL &= ~(uint32_t)timer_bkin;
        } else {
            /* select TRIGSEL */
            SYSCFG_TIMERBKINSEL |= (uint32_t)timer_bkin;
        }
    }
}

/*!
    \brief      CPU core held release set, API ID: 0x0009
    \param[in]  core_num
                only one parameter can be selected which are shown as below:
      \arg        CM7_0: Cortex-M7 core 0
      \arg        CM7_1: Cortex-M7 core 1, only for GD32A72XX/GD32A74XX
    \param[in]  hold_release
                only one parameter can be selected which are shown as below:
      \arg        CPU_HOLD: CPU held
      \arg        CPU_RELEASE: CPU released
    \param[out] none
    \retval     none
*/
void syscfg_cpu_hold_release_set(uint8_t core_num, uint8_t hold_release)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_CM7_NUM(core_num)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(9), ERR_PARAM_INVALID);
    } else if(NOT_CPU_HOLD_RELEASE(hold_release)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(9), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(CM7_0 == core_num) {
            /* configure CM7_0 */
            if(CPU_HOLD == hold_release) {
                SYSCFG_CPUCTL &= ~SYSCFG_CPUCTL_CPU0_HOLD;
            } else {
                SYSCFG_CPUCTL |= SYSCFG_CPUCTL_CPU0_HOLD;
            }
        } else {
#if defined (GD32A72XX) || defined (GD32A74XX)
            /* configure CM7_1 */
            if(CPU_HOLD == hold_release) {
                SYSCFG_CPUCTL &= ~SYSCFG_CPUCTL_CPU1_HOLD;
            } else {
                SYSCFG_CPUCTL |= SYSCFG_CPUCTL_CPU1_HOLD;
            }
#endif /* defined (GD32A72XX) || defined (GD32A74XX) */
        }
    }
}

/*!
    \brief      CPU core AHB slave port priority set, API ID: 0x000A
    \param[in]  core_num
                only one parameter can be selected which are shown as below:
      \arg        CM7_0: Cortex-M7 core 0
      \arg        CM7_1: Cortex-M7 core 1
    \param[in]  priority
                only one parameter can be selected which are shown as below:
      \arg        ROUND_ROBIN: round-robin arbitration
      \arg        AHBS_HIGHER_PRIO: AHB slave port has higher access priority than core access
    \param[out] none
    \retval     none
*/
void syscfg_cpu_ahbs_priority_set(uint8_t core_num, uint8_t priority)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_CM7_NUM(core_num)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(10), ERR_PARAM_INVALID);
    } else if(NOT_SYSCFG_PRIORITY(priority)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(10), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(CM7_0 == core_num) {
            /* configure CM7_0 */
            if(ROUND_ROBIN == priority) {
                SYSCFG_CPUCTL &= ~SYSCFG_CPUCTL_CPU0_AHBSPRI;
            } else {
                SYSCFG_CPUCTL |= SYSCFG_CPUCTL_CPU0_AHBSPRI;
            }
        } else {
#if defined (GD32A72XX) || defined (GD32A74XX)
            /* configure CM7_1 */
            if(ROUND_ROBIN == priority) {
                SYSCFG_CPUCTL &= ~SYSCFG_CPUCTL_CPU1_AHBSPRI;
            } else {
                SYSCFG_CPUCTL |= SYSCFG_CPUCTL_CPU1_AHBSPRI;
            }
#endif /* defined (GD32A72XX) || defined (GD32A74XX) */
        }
    }
}

/*!
    \brief      enable TCM wait state, API ID: 0x000B
    \param[in]  none
    \param[out] none
    \retval     none
*/
void syscfg_tcm_wait_state_enable(void)
{
    SYSCFG_SRAMCFG |= SYSCFG_SRAMCFG_TCM_WAITSTATE;
}

/*!
    \brief      disable TCM wait state, API ID: 0x000C
    \param[in]  none
    \param[out] none
    \retval     none
*/
void syscfg_tcm_wait_state_disable(void)
{
    SYSCFG_SRAMCFG &= ~SYSCFG_SRAMCFG_TCM_WAITSTATE;
}

/*!
    \brief      enable SRAM wait state, API ID: 0x000D
    \param[in]  none
    \param[out] none
    \retval     none
*/
void syscfg_sram_wait_state_enable(void)
{
    SYSCFG_SRAMCFG |= SYSCFG_SRAMCFG_SRAM_WAITSTATE;
}

/*!
    \brief      disable SRAM wait state, API ID: 0x000E
    \param[in]  none
    \param[out] none
    \retval     none
*/
void syscfg_sram_wait_state_disable(void)
{
    SYSCFG_SRAMCFG &= ~SYSCFG_SRAMCFG_SRAM_WAITSTATE;
}

/*!
    \brief      allow recovery mode on system or subsystem reset, API ID: 0x000F
    \param[in]  rm_reset
                only one parameter can be selected which are shown as below:
      \arg        RM_SYSTEM_RESET: recovery mode sequence on system reset
      \arg        RM_SUBSYSTEM_RESET: recovery mode sequence on subsystem reset
    \param[out] none
    \retval     none
*/
void syscfg_recovery_mode_allow(uint8_t rm_reset)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SYSCFG_RM_RESET(rm_reset)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(15), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(RM_SYSTEM_RESET == rm_reset) {
            SYSCFG_RMCFG &= ~SYSCFG_RMCFG_RM_SYSRST_DIS;
        } else {
            SYSCFG_RMCFG &= ~SYSCFG_RMCFG_RM_SUBSRST_DIS;
        }
    }
}

/*!
    \brief      disable recovery mode on system or subsystem reset, API ID: 0x0010
    \param[in]  rm_reset
      \arg        RM_SYSTEM_RESET: recovery mode sequence on system reset
      \arg        RM_SUBSYSTEM_RESET: recovery mode sequence on subsystem reset
    \param[out] none
    \retval     none
*/
void syscfg_recovery_mode_disable(uint8_t rm_reset)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SYSCFG_RM_RESET(rm_reset)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(16), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(RM_SYSTEM_RESET == rm_reset) {
            SYSCFG_RMCFG |= SYSCFG_RMCFG_RM_SYSRST_DIS;
        } else {
            SYSCFG_RMCFG |= SYSCFG_RMCFG_RM_SUBSRST_DIS;
        }
    }
}

