sorosaulong-ux/gd32-test-project/Library/gd32a7xx_syscfg.c
#if defined (GD32A72XX) || defined (GD32A74XX)
/*!
    \brief      lock interrupt router core processor control register, API ID: 0x0011
    \param[in]  none
    \param[out] none
    \retval     none
*/
void syscfg_interrupt_router_reg_lock(void)
{
    SYSCFG_IRCPUCTL |= SYSCFG_IRCPUCTL_LK;
}

/*!
    \brief      configure core processor as trusted core, API ID: 0x0012
    \param[in]  core_num
                only one parameter can be selected which are shown as below:
      \arg        CM7_0: Cortex-M7 core 0
      \arg        CM7_1: Cortex-M7 core 1
    \param[out] none
    \retval     none
*/
void syscfg_trusted_core_config_enable(uint8_t core_num)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_CM7_NUM(core_num)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(18), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(CM7_0 == core_num) {
            SYSCFG_IRCPUCTL |= SYSCFG_IRCPUCTL_CP0TR;
        } else {
            SYSCFG_IRCPUCTL |= SYSCFG_IRCPUCTL_CP1TR;
        }
    }
}

/*!
    \brief      configure core processor as non-trusted core, API ID: 0x0013
    \param[in]  core_num
                only one parameter can be selected which are shown as below:
      \arg        CM7_0: Cortex-M7 core 0
      \arg        CM7_1: Cortex-M7 core 1
    \param[out] none
    \retval     none
*/
void syscfg_trusted_core_config_disable(uint8_t core_num)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_CM7_NUM(core_num)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(19), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(CM7_0 == core_num) {
            SYSCFG_IRCPUCTL &= ~SYSCFG_IRCPUCTL_CP0TR;
        } else {
            SYSCFG_IRCPUCTL &= ~SYSCFG_IRCPUCTL_CP1TR;
        }
    }
}
#endif /* defined (GD32A72XX) || defined (GD32A74XX) */

/*!
    \brief      hard-lock the memory access execution control register, API ID: 0x0014
    \param[in]  none
    \param[out] none
    \retval     none
*/
void syscfg_mem_access_ctlreg_hard_lock(void)
{
    SYSCFG_MEMAEXCTL |= SYSCFG_MEMAEXCTL_HLKEN;
}

/*!
    \brief      soft-lock the memory access execution control register, API ID: 0x0015
    \param[in]  none
    \param[out] none
    \retval     none
*/
void syscfg_mem_access_ctlreg_soft_lock(void)
{
    SYSCFG_MEMAEXCTL |= SYSCFG_MEMAEXCTL_SLKEN;
}

/*!
    \brief      soft-unlock the memory access execution control register, API ID: 0x0016
    \param[in]  none
    \param[out] none
    \retval     none
*/
void syscfg_mem_access_ctlreg_soft_unlock(void)
{
    SYSCFG_MEMAEXCTL &= ~SYSCFG_MEMAEXCTL_SLKEN;
}

/*!
    \brief      allow memory access execution, API ID: 0x0017
    \param[in]  periph_ctl: specify the memory access bit in SYSCFG_MEMAEXCTL
                one or more parameters can be selected which are shown as below:
      \arg        MEMAEXCTL_SRAM0: SRAM 0 controller access execution control bit
      \arg        MEMAEXCTL_SRAM1: SRAM 1 controller access execution control bit
      \arg        MEMAEXCTL_ITCM0_DA: ITCM core 0 direct access execution control bit
      \arg        MEMAEXCTL_ITCM1_DA: ITCM core 1 direct access execution control bit
      \arg        MEMAEXCTL_ITCM0_BDA: ITCM core 0 backdoor access execution control bit
      \arg        MEMAEXCTL_ITCM1_BDA: ITCM core 1 backdoor access execution control bit
      \arg        MEMAEXCTL_DTCM0_DA: DTCM core 0 direct access execution control bit
      \arg        MEMAEXCTL_DTCM1_DA: DTCM core 1 direct access execution control bit
      \arg        MEMAEXCTL_DTCM0_BDA: DTCM core 0 backdoor access execution control bit
      \arg        MEMAEXCTL_DTCM1_BDA: DTCM core 1 backdoor access execution control bit
    \param[out] none
    \retval     none
*/
void syscfg_mem_access_allow(uint32_t periph_ctl)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_MEMAEXCTL_PERIPH(periph_ctl)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(23), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        SYSCFG_MEMAEXCTL &= ~periph_ctl;
    }
}

/*!
    \brief      disable memory access execution, API ID: 0x0018
    \param[in]  periph_ctl: specify the memory access bit in SYSCFG_MEMAEXCTL
                one or more parameters can be selected which are shown as below:
      \arg        MEMAEXCTL_SRAM0: SRAM 0 controller access execution control bit
      \arg        MEMAEXCTL_SRAM1: SRAM 1 controller access execution control bit
      \arg        MEMAEXCTL_ITCM0_DA: ITCM core 0 direct access execution control bit
      \arg        MEMAEXCTL_ITCM1_DA: ITCM core 1 direct access execution control bit
      \arg        MEMAEXCTL_ITCM0_BDA: ITCM core 0 backdoor access execution control bit
      \arg        MEMAEXCTL_ITCM1_BDA: ITCM core 1 backdoor access execution control bit
      \arg        MEMAEXCTL_DTCM0_DA: DTCM core 0 direct access execution control bit
      \arg        MEMAEXCTL_DTCM1_DA: DTCM core 1 direct access execution control bit
      \arg        MEMAEXCTL_DTCM0_BDA: DTCM core 0 backdoor access execution control bit
      \arg        MEMAEXCTL_DTCM1_BDA: DTCM core 1 backdoor access execution control bit
    \param[out] none
    \retval     none
*/
void syscfg_mem_access_disable(uint32_t periph_ctl)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_MEMAEXCTL_PERIPH(periph_ctl)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(24), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        SYSCFG_MEMAEXCTL |= periph_ctl;
    }
}

/*!
    \brief      enable peripheral bus matrix error detection function, API ID: 0x0019
    \param[in]  periph
                only one parameter can be selected which are shown as below:
      \arg        BM1_RD_DATA_CHK_DMA0MEM: read data check DMA0 memory accesses
      \arg        BM1_RD_DATA_CHK_DMA0PERIPH: read data check DMA0 peripheral accesses
      \arg        BM1_RD_DATA_CHK_DMA1MEM: read data check DMA1 memory accesses
      \arg        BM1_RD_DATA_CHK_DMA1PERIPH: read data check DMA1 peripheral accesses
      \arg        BM1_RD_DATA_CHK_HSM_BM1: read data check HSM BM1
      \arg        BM1_RD_DATA_CHK_ENET: read data check ENET
      \arg        BM1_RD_DATA_CHK_CM7_0: read data check Cortex-M7_0_AXIM
      \arg        BM1_RD_DATA_CHK_CM7_1: read data check Cortex-M7_1_AXIM
      \arg        BM1_WR_DATA_CHK_SRAM0: write data check SRAM0
      \arg        BM1_ADDR_CHK_SRAM0: address check SRAM0
      \arg        BM1_WR_DATA_CHK_SRAM1: write data check SRAM1
      \arg        BM1_ADDR_CHK_SRAM1: address check SRAM1
      \arg        BM1_WR_DATA_CHK_QSPI: write data check QSPI
      \arg        BM1_ADDR_CHK_QSPI: address check QSPI
      \arg        BM1_WR_DATA_CHK_FMC0: write data check FMC_0
      \arg        BM1_ADDR_CHK_FMC0: address check FMC_0
      \arg        BM1_WR_DATA_CHK_FMC1: write data check FMC_1
      \arg        BM1_ADDR_CHK_FMC1: address check FMC_1
      \arg        BM1_WR_DATA_CHK_FMC2: write data check FMC_2
      \arg        BM1_ADDR_CHK_FMC2: address check FMC_2
      \arg        BM1_WR_DATA_CHK_TCM: write data check TCM
      \arg        BM1_ADDR_CHK_TCM: address check TCM
      \arg        BM2_RD_DATA_CHK_DMA0MEM: read data check DMA0 memory accesses
      \arg        BM2_RD_DATA_CHK_DMA0PERIPH: read data check DMA0 peripheral accesses
      \arg        BM2_RD_DATA_CHK_DMA1MEM: read data check DMA1 memory accesses
      \arg        BM2_RD_DATA_CHK_DMA1PERIPH: read data check DMA1 peripheral accesses
      \arg        BM2_RD_DATA_CHK_HSM_BM2: read data check HSM BM2
      \arg        BM2_RD_DATA_CHK_AHBP_CM7_0: read data check Cortex-M7_0_AHBP
      \arg        BM2_RD_DATA_CHK_AHBP_CM7_1: read data check Cortex-M7_1_AHBP
      \arg        BM2_WR_DATA_CHK_APB1: write data check APB1
      \arg        BM2_ADDR_CHK_APB1: address check APB1
      \arg        BM2_WR_DATA_CHK_APB2: write data check APB2
      \arg        BM2_ADDR_CHK_APB2: address check APB2
      \arg        BM2_WR_DATA_CHK_AHB1: write data check AHB1
      \arg        BM2_ADDR_CHK_AHB1: address check AHB1
      \arg        BM2_WR_DATA_CHK_AHB2: write data check AHB2
      \arg        BM2_ADDR_CHK_AHB2: address check AHB2
    \param[out] none
    \retval     none
*/
void syscfg_bus_matrix_error_detect_enable(uint32_t periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_BM_PERIPH(periph)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(25), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(0U == (uint32_t)(periph & BUS_MATRIX_2)) {
            /* bus matrix 1 peripheral */
            SYSCFG_BM1EDCEN |= (uint32_t)(periph);
        } else {
            /* bus matrix 2 peripheral */
            SYSCFG_BM2EDCEN |= (uint32_t)(periph & ~BUS_MATRIX_2);
        }
    }
}

/*!
    \brief      disable peripheral in bus matrix error detection function, API ID: 0x001A
    \param[in]  periph
                only one parameter can be selected which are shown as below:
      \arg        BM1_RD_DATA_CHK_DMA0MEM: read data check DMA0 memory accesses
      \arg        BM1_RD_DATA_CHK_DMA0PERIPH: read data check DMA0 peripheral accesses
      \arg        BM1_RD_DATA_CHK_DMA1MEM: read data check DMA1 memory accesses
      \arg        BM1_RD_DATA_CHK_DMA1PERIPH: read data check DMA1 peripheral accesses
      \arg        BM1_RD_DATA_CHK_HSM_BM1: read data check HSM BM1
      \arg        BM1_RD_DATA_CHK_ENET: read data check ENET
      \arg        BM1_RD_DATA_CHK_CM7_0: read data check Cortex-M7_0_AXIM
      \arg        BM1_RD_DATA_CHK_CM7_1: read data check Cortex-M7_1_AXIM
      \arg        BM1_WR_DATA_CHK_SRAM0: write data check SRAM0
      \arg        BM1_ADDR_CHK_SRAM0: address check SRAM0
      \arg        BM1_WR_DATA_CHK_SRAM1: write data check SRAM1
      \arg        BM1_ADDR_CHK_SRAM1: address check SRAM1
      \arg        BM1_WR_DATA_CHK_QSPI: write data check QSPI
      \arg        BM1_ADDR_CHK_QSPI: address check QSPI
      \arg        BM1_WR_DATA_CHK_FMC0: write data check FMC_0
      \arg        BM1_ADDR_CHK_FMC0: address check FMC_0
      \arg        BM1_WR_DATA_CHK_FMC1: write data check FMC_1
      \arg        BM1_ADDR_CHK_FMC1: address check FMC_1
      \arg        BM1_WR_DATA_CHK_FMC2: write data check FMC_2
      \arg        BM1_ADDR_CHK_FMC2: address check FMC_2
      \arg        BM1_WR_DATA_CHK_TCM: write data check TCM
      \arg        BM1_ADDR_CHK_TCM: address check TCM
      \arg        BM2_RD_DATA_CHK_DMA0MEM: read data check DMA0 memory accesses
      \arg        BM2_RD_DATA_CHK_DMA0PERIPH: read data check DMA0 peripheral accesses
      \arg        BM2_RD_DATA_CHK_DMA1MEM: read data check DMA1 memory accesses
      \arg        BM2_RD_DATA_CHK_DMA1PERIPH: read data check DMA1 peripheral accesses
      \arg        BM2_RD_DATA_CHK_HSM_BM2: read data check HSM BM2
      \arg        BM2_RD_DATA_CHK_AHBP_CM7_0: read data check Cortex-M7_0_AHBP
      \arg        BM2_RD_DATA_CHK_AHBP_CM7_1: read data check Cortex-M7_1_AHBP
      \arg        BM2_WR_DATA_CHK_APB1: write data check APB1
      \arg        BM2_ADDR_CHK_APB1: address check APB1
      \arg        BM2_WR_DATA_CHK_APB2: write data check APB2
      \arg        BM2_ADDR_CHK_APB2: address check APB2
      \arg        BM2_WR_DATA_CHK_AHB1: write data check AHB1
      \arg        BM2_ADDR_CHK_AHB1: address check AHB1
      \arg        BM2_WR_DATA_CHK_AHB2: write data check AHB2
      \arg        BM2_ADDR_CHK_AHB2: address check AHB2
    \param[out] none
    \retval     none
*/
void syscfg_bus_matrix_error_detect_disable(uint32_t periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_BM_PERIPH(periph)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(26), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(0U == (uint32_t)(periph & BUS_MATRIX_2)) {
            /* bus matrix 1 peripheral */
            SYSCFG_BM1EDCEN &= (uint32_t)(~periph);
        } else {
            /* bus matrix 2 peripheral */
            SYSCFG_BM2EDCEN &= (uint32_t)~(periph & ~BUS_MATRIX_2);
        }
    }
}

/*!
    \brief      enable peripheral bus check function, API ID: 0x001B
    \param[in]  periph
                one or more parameters can be selected which are shown as below:
      \arg        ENET_MEM_PORT_CHK: ENET mem port timeout and slaver ID check, only in GD32A714Axx /A72xAxx / A74xAxx
      \arg        HSM_PORT_CHK: HSM port timeout and slaver ID check
      \arg        DMA0MEM_PORT_CHK: DMA0 mem port timeout and slaver ID check
      \arg        DMA0PERIPH_PORT_CHK: DMA0 peri port timeout and slaver ID check
      \arg        DMA1MEM_PORT_CHK: DMA1 mem port timeout and slaver ID check
      \arg        DMA1PERIPH_PORT_CHK: DMA1 peri port timeout and slaver ID check
      \arg        AHBP_CM7_0_PORT_CHK: CM7_0 AHBP port timeout and slaver ID check
      \arg        AHBP_CM7_1_PORT_CHK: CM7_1 AHBP port timeout and slaver ID check
      \arg        AXIM_CM7_0_PORT_CHK: CM7_0 AXIM port timeout and slaver ID check
      \arg        AXIM_CM7_1_PORT_CHK: CM7_1 AXIM port timeout and slaver ID check
      \arg        DMA0MEM_SPLIT0_WIDGET_CHK: split0 widget of DMA0 mem redundant check
      \arg        DMA0PERIPH_SPLIT0_WIDGET_CHK: split0 widget of DMA0 peri redundant check
      \arg        DMA1MEM_SPLIT0_WIDGET_CHK: split0 widget of DMA1 mem redundant check
      \arg        DMA1PERIPH_SPLIT0_WIDGET_CHK: split0 widget of DMA1 peri redundant check
      \arg        HSM_SPLIT1_WIDGET_CHK: split1 widget of HSM redundant check
      \arg        TCM_SPLIT1_WIDGET_CHK: split1 widget of TCM SRAM redundant check
      \arg        HSM_H2H1_WIDGET_CHK: H2H1 widget of HSM redundant check
      \arg        DMA0MEM_H2H0_WIDGET_CHK: H2H0 widget of DMA0 mem redundant check
      \arg        DMA0PERIPH_H2H0_WIDGET_CHK: H2H0 widget of DMA0 peri redundant check
      \arg        DMA1MEM_H2H0_WIDGET_CHK: H2H0 widget of DMA1 mem redundant check
      \arg        DMA1PERIPH_H2H0_WIDGET_CHK: H2H0 widget of DMA1 peri redundant check
      \arg        QSPI_H2H0_WIDGET_CHK: H2H0 widget of QSPI redundant check
      \arg        TCM_H2H0_WIDGET_CHK: H2H0 widget of TCM redundant check
      \arg        ENET_WIDGET_CHK: ENET 1:1/1:2 widget check
      \arg        TCM_WIDGET_CHK: TCM 1:1 widget check
      \arg        APB1_CHK: APB1 redundant check
      \arg        APB2_CHK: APB2 redundant check
      \arg        AHB1_CHK: AHB1 redundant check
      \arg        AHB2_CHK: AHB2 redundant check
    \param[out] none
    \retval     none
*/
void syscfg_bus_check_enable(uint32_t periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_BUS_CHK_PERIPH(periph)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(27), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        SYSCFG_BUSCHKCFG |= periph;
    }
}

/*!
    \brief      disable peripheral bus check function, API ID: 0x001C
    \param[in]  periph
                one or more parameters can be selected which are shown as below:
      \arg        ENET_MEM_PORT_CHK: ENET mem port timeout and slaver ID check, only in GD32A714Axx /A72xAxx / A74xAxx
      \arg        HSM_PORT_CHK: HSM port timeout and slaver ID check
      \arg        DMA0MEM_PORT_CHK: DMA0 mem port timeout and slaver ID check
      \arg        DMA0PERIPH_PORT_CHK: DMA0 peri port timeout and slaver ID check
      \arg        DMA1MEM_PORT_CHK: DMA1 mem port timeout and slaver ID check
      \arg        DMA1PERIPH_PORT_CHK: DMA1 peri port timeout and slaver ID check
      \arg        AHBP_CM7_0_PORT_CHK: CM7_0 AHBP port timeout and slaver ID check
      \arg        AHBP_CM7_1_PORT_CHK: CM7_1 AHBP port timeout and slaver ID check
      \arg        AXIM_CM7_0_PORT_CHK: CM7_0 AXIM port timeout and slaver ID check
      \arg        AXIM_CM7_1_PORT_CHK: CM7_1 AXIM port timeout and slaver ID check
      \arg        DMA0MEM_SPLIT0_WIDGET_CHK: split0 widget of DMA0 mem redundant check
      \arg        DMA0PERIPH_SPLIT0_WIDGET_CHK: split0 widget of DMA0 peri redundant check
      \arg        DMA1MEM_SPLIT0_WIDGET_CHK: split0 widget of DMA1 mem redundant check
      \arg        DMA1PERIPH_SPLIT0_WIDGET_CHK: split0 widget of DMA1 peri redundant check
      \arg        HSM_SPLIT1_WIDGET_CHK: split1 widget of HSM redundant check
      \arg        TCM_SPLIT1_WIDGET_CHK: split1 widget of TCM SRAM redundant check
      \arg        HSM_H2H1_WIDGET_CHK: H2H1 widget of HSM redundant check
      \arg        DMA0MEM_H2H0_WIDGET_CHK: H2H0 widget of DMA0 mem redundant check
      \arg        DMA0PERIPH_H2H0_WIDGET_CHK: H2H0 widget of DMA0 peri redundant check
      \arg        DMA1MEM_H2H0_WIDGET_CHK: H2H0 widget of DMA1 mem redundant check
      \arg        DMA1PERIPH_H2H0_WIDGET_CHK: H2H0 widget of DMA1 peri redundant check
      \arg        QSPI_H2H0_WIDGET_CHK: H2H0 widget of QSPI redundant check
      \arg        TCM_H2H0_WIDGET_CHK: H2H0 widget of TCM redundant check
      \arg        ENET_WIDGET_CHK: ENET 1:1/1:2 widget check, only in GD32A714Axx /A72xAxx / A74xAxx
      \arg        TCM_WIDGET_CHK: TCM 1:1 widget check
      \arg        APB1_CHK: APB1 redundant check
      \arg        APB2_CHK: APB2 redundant check
      \arg        AHB1_CHK: AHB1 redundant check
      \arg        AHB2_CHK: AHB2 redundant check
    \param[out] none
    \retval     none
*/
void syscfg_bus_check_disable(uint32_t periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_BUS_CHK_PERIPH(periph)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(28), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        SYSCFG_BUSCHKCFG &= ~periph;
    }
}

/*!
    \brief      enable the interrupt from the peripheral to the CPU NMI, API ID: 0x001D
    \param[in]  cpu_interrupt
                one or more parameters can be selected which are shown as below:
      \arg        SYSCFG_INT_CPU0_CKMNMI: NMI interrupt from EXTI enable bit of CPU0
      \arg        SYSCFG_INT_CPU0_NMIPIN: HXTAL clock monitor NMI interrupt enable bit of CPU0
      \arg        SYSCFG_INT_CPU0_FMUNMI: FMU NMI interrupt enable bit of CPU0
      \arg        SYSCFG_INT_CPU1_CKMNMI: NMI interrupt from EXTI enable bit of CPU1
      \arg        SYSCFG_INT_CPU1_NMIPIN: HXTAL clock monitor NMI interrupt enable bit of CPU1
      \arg        SYSCFG_INT_CPU1_FMUNMI: FMU NMI interrupt enable bit of CPU1
    \param[out] none
    \retval     none
*/
void syscfg_nmi_interrupt_enable(uint32_t cpu_interrupt)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SYSCFG_INT_CPU_NMI(cpu_interrupt)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(29), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        SYSCFG_CFG |= cpu_interrupt;
    }
}

/*!
    \brief      disable the interrupt from the peripheral to the CPU NMI, API ID: 0x001F
    \param[in]  cpu_interrupt
                one or more parameters can be selected which are shown as below:
      \arg        SYSCFG_INT_CPU0_CKMNMI: NMI interrupt from EXTI enable bit of CPU0
      \arg        SYSCFG_INT_CPU0_NMIPIN: HXTAL clock monitor NMI interrupt enable bit of CPU0
      \arg        SYSCFG_INT_CPU0_FMUNMI: FMU NMI interrupt enable bit of CPU0
      \arg        SYSCFG_INT_CPU1_CKMNMI: NMI interrupt from EXTI enable bit of CPU1
      \arg        SYSCFG_INT_CPU1_NMIPIN: HXTAL clock monitor NMI interrupt enable bit of CPU1
      \arg        SYSCFG_INT_CPU1_FMUNMI: FMU NMI interrupt enable bit of CPU1
    \param[out] none
    \retval     none
*/
void syscfg_nmi_interrupt_disable(uint32_t cpu_interrupt)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_SYSCFG_INT_CPU_NMI(cpu_interrupt)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(30), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        SYSCFG_CFG &= ~cpu_interrupt;
    }
}

/*!
    \brief      enable FPU error and TCM write abort interrupt, API ID: 0x0020
    \param[in]  core_num
                only one parameter can be selected which are shown as below:
      \arg        CM7_0: Cortex-M7 core 0
      \arg        CM7_1: Cortex-M7 core 1
    \param[in]  fpu_tcm_int
                one or more parameters can be selected which are shown as below:
      \arg        SYSCFG_FPUINT_INEXACT: FPU inexact interrupt
      \arg        SYSCFG_FPUINT_INPUT_ABNORMAL: FPU input abnormal interrupt
      \arg        SYSCFG_FPUINT_OVERFLOW: FPU overflow interrupt
      \arg        SYSCFG_FPUINT_UNDERFLOW: FPU underflow interrupt
      \arg        SYSCFG_FPUINT_DIV0: FPU divide-by-zero interrupt
      \arg        SYSCFG_FPUINT_INVALID_OPERATION: FPU invalid operation interrupt
      \arg        SYSCFG_TCMINT_WR_ABORT: write abort on slave overrun interrupt
    \param[out] none
    \retval     none
*/
void syscfg_fpu_tcm_interrupt_enable(uint8_t core_num, uint32_t fpu_tcm_int)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_CM7_NUM(core_num)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(31), ERR_PARAM_INVALID);
    } else if(NOT_FPU_TCM_INT(fpu_tcm_int)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(31), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(CM7_0 == core_num) {
            /* configure CM7_0 */
            SYSCFG_CPU0CS |= fpu_tcm_int;
        } else {
#if defined (GD32A72XX) || defined (GD32A74XX)
            /* configure CM7_1 */
            SYSCFG_CPU1CS |= fpu_tcm_int;
#endif /* defined (GD32A72XX) || defined (GD32A74XX) */
        }
    }
}

/*!
    \brief      disable FPU error and TCM write abort interrupt, API ID: 0x0021
    \param[in]  core_num
                only one parameter can be selected which are shown as below:
      \arg        CM7_0: Cortex-M7 core 0
      \arg        CM7_1: Cortex-M7 core 1
    \param[in]  cpu_interrupt
                one or more parameters can be selected which are shown as below:
      \arg        SYSCFG_FPUINT_INEXACT: FPU inexact interrupt
      \arg        SYSCFG_FPUINT_INPUT_ABNORMAL: FPU input abnormal interrupt
      \arg        SYSCFG_FPUINT_OVERFLOW: FPU overflow interrupt
      \arg        SYSCFG_FPUINT_UNDERFLOW: FPU underflow interrupt
      \arg        SYSCFG_FPUINT_DIV0: FPU divide-by-zero interrupt
      \arg        SYSCFG_FPUINT_INVALID_OPERATION: FPU invalid operation interrupt
      \arg        SYSCFG_TCMINT_WR_ABORT: write abort on slave overrun interrupt
    \param[out] none
    \retval     none
*/
void syscfg_fpu_tcm_interrupt_disable(uint8_t core_num, uint32_t fpu_tcm_int)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_CM7_NUM(core_num)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(32), ERR_PARAM_INVALID);
    } else if(NOT_FPU_TCM_INT(fpu_tcm_int)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(32), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(CM7_0 == core_num) {
            /* configure CM7_0 */
            SYSCFG_CPU0CS &= ~fpu_tcm_int;
        } else {
#if defined (GD32A72XX) || defined (GD32A74XX)
            /* configure CM7_1 */
            SYSCFG_CPU1CS &= ~fpu_tcm_int;
#endif /* defined (GD32A72XX) || defined (GD32A74XX) */
        }
    }
}

