sorosaulong-ux/gd32-test-project/Library/gd32a7xx_syscfg.c
#if defined (GD32A72XX) || defined (GD32A74XX)
/*!
    \brief      enable interrupt router interrupt, API ID: 0x0022
    \param[in]  core_num
                only one parameter can be selected which are shown as below:
      \arg        CM7_0: Cortex-M7 core 0
      \arg        CM7_1: Cortex-M7 core 1
    \param[in]  ir_cp_int
                only one parameter can be selected which are shown as below:
      \arg        INTROUTER_CP_INT_0: interrupt router core processer interrupt 0
      \arg        INTROUTER_CP_INT_1: interrupt router core processer interrupt 1
      \arg        INTROUTER_CP_INT_2: interrupt router core processer interrupt 2
      \arg        INTROUTER_CP_INT_3: interrupt router core processer interrupt 3
    \param[out] none
    \retval     none
*/
void syscfg_interrupt_router_interrupt_enable(uint8_t core_num, uint32_t ir_cp_int)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_CM7_NUM(core_num)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(33), ERR_PARAM_INVALID);
    } else if(NOT_IR_CP_INT(ir_cp_int)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(33), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(CM7_0 == core_num) {
            /* configure CM7_0 interrupt router */
            REG32(SYSCFG + 0x00000304U + (uint32_t)(ir_cp_int * 0x08U)) |= SYSCFG_IRCP0INT0_CPIE;
        } else {
            /* configure CM7_1 interrupt router */
            REG32(SYSCFG + 0x00000324U + (uint32_t)(ir_cp_int * 0x08U)) |= SYSCFG_IRCP1INT0_CPIE;
        }
    }
}

/*!
    \brief      disable interrupt router interrupt, API ID: 0x0023
    \param[in]  core_num
                only one parameter can be selected which are shown as below:
      \arg        CM7_0: Cortex-M7 core 0
      \arg        CM7_1: Cortex-M7 core 1
    \param[in]  ir_cp_int
                only one parameter can be selected which are shown as below:
      \arg        INTROUTER_CP_INT_0: interrupt router core processer interrupt 0
      \arg        INTROUTER_CP_INT_1: interrupt router core processer interrupt 1
      \arg        INTROUTER_CP_INT_2: interrupt router core processer interrupt 2
      \arg        INTROUTER_CP_INT_3: interrupt router core processer interrupt 3
    \param[out] none
    \retval     none
*/
void syscfg_interrupt_router_interrupt_disable(uint8_t core_num, uint32_t ir_cp_int)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_CM7_NUM(core_num)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(34), ERR_PARAM_INVALID);
    } else if(NOT_IR_CP_INT(ir_cp_int)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(34), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(CM7_0 == core_num) {
            /* configure CM7_0 interrupt router */
            REG32(SYSCFG + 0x00000304U + ir_cp_int * 0x08U) &= ~SYSCFG_IRCP0INT0_CPIE;
        } else {
            /* configure CM7_1 interrupt router */
            REG32(SYSCFG + 0x00000324U + ir_cp_int * 0x08U) &= ~SYSCFG_IRCP1INT0_CPIE;
        } 
    }
}
#endif /* defined (GD32A72XX) || defined (GD32A74XX) */

/*!
    \brief      enable TMR error interrupt, API ID: 0x0024
    \param[in]  tmrerr_int
                only one parameter can be selected which are shown as below:
      \arg        TMRERR_INT_FMUNMI: TMR fault interrupt enable of the FMU NMI interrupt flag enable
      \arg        TMRERR_INT_CPEN: TMR fault interrupt enable of the CPU released
      \arg        TMRERR_INT_MEMEXECR: TMR fault interrupt enable of the memory execution control register
      \arg        TMRERR_INT_CPINT: TMR fault interrupt enable of the interrupt router CPn interrupt status register
    \param[out] none
    \retval     none
*/
void syscfg_tmr_error_interrupt_enable(uint32_t tmrerr_int)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TMRERR_INT(tmrerr_int)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(35), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        SYSCFG_TMRFCS |= tmrerr_int;
    }
}

/*!
    \brief      disable TMR error interrupt, API ID: 0x0025
    \param[in]  tmrerr_int
                only one parameter can be selected which are shown as below:
      \arg        TMRERR_INT_FMUNMI: TMR fault interrupt enable of the FMU NMI interrupt flag enable
      \arg        TMRERR_INT_CPEN: TMR fault interrupt enable of the CPU released
      \arg        TMRERR_INT_MEMEXECR: TMR fault interrupt enable of the memory execution control register
      \arg        TMRERR_INT_CPINT: TMR fault interrupt enable of the interrupt router CPn interrupt status register
    \param[out] none
    \retval     none
*/
void syscfg_tmr_error_interrupt_disable(uint32_t tmrerr_int)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TMRERR_INT(tmrerr_int)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(36), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        SYSCFG_TMRFCS &= ~tmrerr_int;
    }
}

/*!
    \brief      get NMI interrupt flag, API ID: 0x0026
    \param[in]  nmi_flag
                one or more parameters can be selected which are shown as below:
      \arg        SYSCFG_FLAG_CKMNMIERR: HXTAL clock monitor NMI error flag
      \arg        SYSCFG_FLAG_NMIPINERR: NMI pin error flag
      \arg        SYSCFG_FLAG_FMUNMIERR: FMU NMI error flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus syscfg_nmi_flag_get(uint32_t nmi_flag)
{
    FlagStatus reval = RESET;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_NMI_FLAG(nmi_flag)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(37), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(0U != (SYSCFG_STAT & nmi_flag)) {
            reval = SET;
        } else {
            /* this code is written to avoid MISRA 15.7 (no 'else' at end of 'if ... else if' chain) */
        }
    }
    return reval;
}

/*!
    \brief      get FPU error and TCM write abort interrupt flag, API ID: 0x0027
    \param[in]  core_num
                only one parameter can be selected which are shown as below:
      \arg        CM7_0: Cortex-M7 core 0
      \arg        CM7_1: Cortex-M7 core 1
    \param[in]  fpu_tcm_intflag
                one or more parameters can be selected which are shown as below:
      \arg        SYSCFG_FPUINT_FLAG_INEXACT: FPU inexact interrupt flag
      \arg        SYSCFG_FPUINT_FLAG_INPUT_ABNORMAL: FPU input abnormal interrupt flag
      \arg        SYSCFG_FPUINT_FLAG_OVERFLOW: FPU overflow interrupt flag
      \arg        SYSCFG_FPUINT_FLAG_UNDERFLOW: FPU underflow interrupt flag
      \arg        SYSCFG_FPUINT_FLAG_DIV0: FPU divide-by-zero interrupt flag
      \arg        SYSCFG_FPUINT_FLAG_INVALID_OPERATION: FPU invalid operation interrupt flag
      \arg        SYSCFG_TCMINT_FLAG_WR_ABORT: write abort on slave overrun interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus syscfg_fpu_tcm_interrupt_flag_get(uint8_t core_num, uint32_t fpu_tcm_intflag)
{
    FlagStatus reval = RESET;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_CM7_NUM(core_num)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(38), ERR_PARAM_INVALID);
    } else if(NOT_FPU_TCM_INTFLAG(fpu_tcm_intflag)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(38), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(CM7_0 == core_num) {
            if(0U != (SYSCFG_CPU0CS & fpu_tcm_intflag)) {
                reval = SET;
            } else {
                /* this code is written to avoid MISRA 15.7 (no 'else' at end of 'if ... else if' chain) */
            }
        } else {
#if defined (GD32A72XX) || defined (GD32A74XX)
            if(0U != (SYSCFG_CPU1CS & fpu_tcm_intflag)) {
                reval = SET;
            } else {
                /* this code is written to avoid MISRA 15.7 (no 'else' at end of 'if ... else if' chain) */
            }
#endif /* defined (GD32A72XX) || defined (GD32A74XX) */
        }
    }
    return reval;
}

/*!
    \brief      get CPU I-Cache error status, API ID: 0x0028
    \param[in]  core_num
                only one parameter can be selected which are shown as below:
      \arg        CM7_0: Cortex-M7 core 0
      \arg        CM7_1: Cortex-M7 core 1
    \param[in]  cache_error
                only one parameter can be selected which are shown as below:
      \arg        CPU_CACHE_ERROR_DETECTION: select detection information of CPU
      \arg        CPU_CACHE_ERROR_BANK: select error information of CPU
    \param[out] none
    \retval     I-Cache error
*/
uint32_t syscfg_icache_error_status_get(uint8_t core_num, uint32_t cache_error)
{
    uint32_t reval = 0U;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_CM7_NUM(core_num)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(39), ERR_PARAM_INVALID);
    } else if(NOT_CPU_CACHE_ERROR(cache_error)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(39), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(CM7_0 == core_num) {
            if(CPU_CACHE_ERROR_DETECTION != cache_error) {
                reval = (uint32_t)((uint32_t)(SYSCFG_CPU0ICAC & 0x0FFFFFC0U) >> 6U);
            } else {
                reval = (uint32_t)(SYSCFG_CPU0ICAC >> 28U);
            }
        } else {
#if defined (GD32A72XX) || defined (GD32A74XX)
            if(CPU_CACHE_ERROR_DETECTION != cache_error) {
                reval = (uint32_t)((SYSCFG_CPU1ICAC & 0x0FFFFFC0U) >> 6U);
            } else {
                reval = (uint32_t)(SYSCFG_CPU1ICAC >> 28U);
            }
#endif /* defined (GD32A72XX) || defined (GD32A74XX) */
        }
    }
    return reval;
}

/*!
    \brief      get CPU D-Cache error status, API ID: 0x0029
    \param[in]  core_num
                only one parameter can be selected which are shown as below:
      \arg        CM7_0: Cortex-M7 core 0
      \arg        CM7_1: Cortex-M7 core 1
    \param[in]  cache_error
                only one parameter can be selected which are shown as below:
      \arg        CPU_CACHE_ERROR_DETECTION: select detection information of CPU
      \arg        CPU_CACHE_ERROR_BANK: select error information of CPU
    \param[out] none
    \retval     D-Cache error
*/
uint32_t syscfg_dcache_error_status_get(uint8_t core_num, uint32_t cache_error)
{
    uint32_t reval = 0U;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_CM7_NUM(core_num)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(40), ERR_PARAM_INVALID);
    } else if(NOT_CPU_CACHE_ERROR(cache_error)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(40), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(CM7_0 == core_num) {
            if(CPU_CACHE_ERROR_DETECTION != cache_error) {
                reval = (uint32_t)((SYSCFG_CPU0DCAC & 0x0FFFFFC0U) >> 6U);
            } else {
                reval = (uint32_t)(SYSCFG_CPU0DCAC >> 28U);
            }
        } else {
#if defined (GD32A72XX) || defined (GD32A74XX)
            if(CPU_CACHE_ERROR_DETECTION != cache_error) {
                reval = (uint32_t)((SYSCFG_CPU1DCAC & 0x0FFFFFC0U) >> 6U);
            } else {
                reval = (uint32_t)(SYSCFG_CPU1DCAC >> 28U);
            }
#endif /* defined (GD32A72XX) || defined (GD32A74XX) */
        }
    }
    return reval;
}

#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
/*!
    \brief      get CPU platform status, API ID: 0x002A
    \param[in]  none
    \param[out] none
    \retval     CPU platform status information
      \arg        LOCKSTEP_MODE: the host core is in lockstep mode
      \arg        SINGLE_CORE: the host core is single core
      \arg        DUAL_CORE: the host core is dual core
*/
syscfg_cpustat_enum syscfg_cpu_platform_status_get(void)
{
    syscfg_cpustat_enum syscfg_cpustat = LOCKSTEP_MODE;
    switch(SYSCFG_CPUSTAT & SYSCFG_CPUSTAT_CPUSTAT) {
    /* get CPU platform status */
    case 2:
        syscfg_cpustat = SINGLE_CORE;
        break;
    case 3:
        syscfg_cpustat = DUAL_CORE;
        break;
    default:
        break;
    }
    return syscfg_cpustat;
}
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

/*!
    \brief      get HSM sub system has entered standby flag, API ID: 0x002B
    \param[in]  none
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus syscfg_hsm_enter_standby_flag_get(void)
{
    FlagStatus reval = RESET;
    if(0U != (SYSCFG_HSMSTAT & SYSCFG_HSMSTAT_HSM_ENTER_STDBY)) {
        reval = SET;
    } else {
        /* this code is written to avoid MISRA 15.7 (no 'else' at end of 'if ... else if' chain) */
    }
    return reval;
}

#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
/*!
    \brief      get core processor ID, API ID: 0x002C
    \param[in]  none
    \param[out] none
    \retval     core processor ID
*/
uint32_t syscfg_cpu_id_get(void)
{
    uint32_t core_id = 0U;
    if(CPU0_ID == SYSCFG_CPID) {
        core_id = CPU0_ID;
    }
#if defined (GD32A72XX) || defined (GD32A74XX)
    else if(CPU1_ID == SYSCFG_CPID) {
        core_id = CPU1_ID;
    }
#endif /* defined (GD32A72XX) || defined (GD32A74XX) */
    else {
        /* this code is written to avoid MISRA 15.7 (no 'else' at end of 'if ... else if' chain) */
    }
    return core_id;
}


/*!
    \brief      get core processor number, API ID: 0x002D
    \param[in]  none
    \param[out] none
    \retval     core processor number
*/
uint8_t syscfg_cpu_number_get(void)
{
    uint8_t core_num = 0U;
    if(CM7_0 == (SYSCFG_CPNUM & SYSCFG_CPNUM_CPNUM)) {
        core_num = CM7_0;
    }
#if defined (GD32A72XX) || defined (GD32A74XX)
    else if(CM7_1 == (SYSCFG_CPNUM & SYSCFG_CPNUM_CPNUM)) {
        core_num = CM7_1;
    }
#endif /* defined (GD32A72XX) || defined (GD32A74XX) */
    else {
        /* this code is written to avoid MISRA 15.7 (no 'else' at end of 'if ... else if' chain) */
    }
    return core_num;
}

/*!
    \brief      get CPU cache information, API ID: 0x002E
    \param[in]  cache_info
                only one parameter can be selected which are shown as below:
      \arg        ICACHE_INFO: I-Cache information
      \arg        DCACHE_INFO: D-Cache information
    \param[out] none
    \retval     CPU cache information
*/
uint32_t syscfg_cpu_cache_info_get(uint32_t cache_info)
{
    uint32_t ret_cache_info = 0U;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_CACHE_INFO(cache_info)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(45), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ICACHE_INFO == cache_info) {
            ret_cache_info = (uint32_t)((uint32_t)((SYSCFG_CPCFGINF0 & BITS(16, 31)) >> 16U));
        } else {
            ret_cache_info = (uint32_t)(SYSCFG_CPCFGINF0 & BITS(0, 15));
        }
    }
    return ret_cache_info;
}

/*!
    \brief      get TCM size information, API ID: 0x002F
    \param[in]  tcm_info
                only one parameter can be selected which are shown as below:
      \arg        ITCM_INFO: ITCM information
      \arg        DTCM_INFO: DTCM information
    \param[out] none
    \retval     TCM information
*/
uint32_t syscfg_cpu_tcm_size_get(uint32_t tcm_info)
{
    uint32_t ret_tcm_info = 0U;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TCM_INFO(tcm_info)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(46), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ITCM_INFO == tcm_info) {
            ret_tcm_info = (uint32_t)((uint32_t)((SYSCFG_CPCFGINF1 & SYSCFG_CPCFGINF1_ITCM_SZ) >> 16U));
        } else {
            ret_tcm_info = (uint32_t)((uint32_t)((SYSCFG_CPCFGINF1 & SYSCFG_CPCFGINF1_DTCM_SZ) >> 24U));
        }
    }
    return ret_tcm_info;
}

/*!
    \brief      get core processor configuration information, API ID: 0x0030
    \param[in]  none
    \param[out] none
    \retval     core processor configuration information
*/
uint32_t syscfg_cpu_config_info_get(void)
{
    return (uint32_t)(SYSCFG_CPCFGINF2 & BITS(0, 4));
}
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

/*!
    \brief      get core 0 processor ID, API ID: 0x0036
    \param[in]  none
    \param[out] none
    \retval     core processor ID
*/
uint32_t syscfg_cpu0_id_get(void)
{
    return SYSCFG_CP0ID;
}


/*!
    \brief      get core processor 0 number, API ID: 0x0037
    \param[in]  none
    \param[out] none
    \retval     core processor number
*/
uint8_t syscfg_cpu0_number_get(void)
{
    return (uint8_t)SYSCFG_CP0NUM;
}

/*!
    \brief      get CPU 0 cache information, API ID: 0x0038
    \param[in]  cache_info
                only one parameter can be selected which are shown as below:
      \arg        ICACHE_INFO: I-Cache information
      \arg        DCACHE_INFO: D-Cache information
    \param[out] none
    \retval     CPU cache information
*/
uint32_t syscfg_cpu0_cache_info_get(uint32_t cache_info)
{
    uint32_t ret_cache_info = 0U;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_CACHE_INFO(cache_info)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(56), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ICACHE_INFO == cache_info) {
            ret_cache_info = (uint32_t)((uint32_t)((SYSCFG_CP0CFGINF0 & BITS(16, 31)) >> 16U));
        } else {
            ret_cache_info = (uint32_t)(SYSCFG_CP0CFGINF0 & BITS(0, 15));
        }
    }
    return ret_cache_info;
}

/*!
    \brief      get CPU 0 TCM size information, API ID: 0x0039
    \param[in]  tcm_info
                only one parameter can be selected which are shown as below:
      \arg        ITCM_INFO: ITCM information
      \arg        DTCM_INFO: DTCM information
    \param[out] none
    \retval     TCM information
*/
uint32_t syscfg_cpu0_tcm_size_get(uint32_t tcm_info)
{
    uint32_t ret_tcm_info = 0U;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TCM_INFO(tcm_info)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(57), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ITCM_INFO == tcm_info) {
            ret_tcm_info = (uint32_t)((uint32_t)((SYSCFG_CP0CFGINF1 & SYSCFG_CP0CFGINF1_ITCM_SZ) >> 16U));
        } else {
            ret_tcm_info = (uint32_t)((uint32_t)((SYSCFG_CP0CFGINF1 & SYSCFG_CP0CFGINF1_DTCM_SZ) >> 24U));
        }
    }
    return ret_tcm_info;
}

/*!
    \brief      get core 0 processor configuration information, API ID: 0x003A
    \param[in]  none
    \param[out] none
    \retval     core processor configuration information
*/
uint32_t syscfg_cpu0_config_info_get(void)
{
    return (uint32_t)(SYSCFG_CP0CFGINF2 & BITS(0, 4));
}

