sorosaulong-ux/gd32-test-project/Library/gd32a7xx_syscfg.c
#if defined (GD32A72XX) || defined (GD32A74XX)

/*!
    \brief      get core 1 processor ID, API ID: 0x003B
    \param[in]  none
    \param[out] none
    \retval     core processor ID
*/
uint32_t syscfg_cpu1_id_get(void)
{
    return SYSCFG_CP1ID;
}


/*!
    \brief      get core processor 1 number, API ID: 0x003C
    \param[in]  none
    \param[out] none
    \retval     core processor number
*/
uint8_t syscfg_cpu1_number_get(void)
{
    return SYSCFG_CP1NUM;
}

/*!
    \brief      get CPU 1 cache information, API ID: 0x003D
    \param[in]  cache_info
                only one parameter can be selected which are shown as below:
      \arg        ICACHE_INFO: I-Cache information
      \arg        DCACHE_INFO: D-Cache information
    \param[out] none
    \retval     CPU cache information
*/
uint32_t syscfg_cpu1_cache_info_get(uint32_t cache_info)
{
    uint32_t ret_cache_info = 0U;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_CACHE_INFO(cache_info)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(61), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ICACHE_INFO == cache_info) {
            ret_cache_info = (uint32_t)((uint32_t)((SYSCFG_CP1CFGINF0 & BITS(16, 31)) >> 16U));
        } else {
            ret_cache_info = (uint32_t)(SYSCFG_CP1CFGINF0 & BITS(0, 15));
        }
    }
    return ret_cache_info;
}

/*!
    \brief      get CPU 1 TCM size information, API ID: 0x003E
    \param[in]  tcm_info
                only one parameter can be selected which are shown as below:
      \arg        ITCM_INFO: ITCM information
      \arg        DTCM_INFO: DTCM information
    \param[out] none
    \retval     TCM information
*/
uint32_t syscfg_cpu1_tcm_size_get(uint32_t tcm_info)
{
    uint32_t ret_tcm_info = 0U;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TCM_INFO(tcm_info)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(62), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ITCM_INFO == tcm_info) {
            ret_tcm_info = (uint32_t)((uint32_t)((SYSCFG_CP1CFGINF1 & SYSCFG_CP1CFGINF1_ITCM_SZ) >> 16U));
        } else {
            ret_tcm_info = (uint32_t)((uint32_t)((SYSCFG_CP1CFGINF1 & SYSCFG_CP1CFGINF1_DTCM_SZ) >> 24U));
        }
    }
    return ret_tcm_info;
}

/*!
    \brief      get core 1 processor configuration information, API ID: 0x003F
    \param[in]  none
    \param[out] none
    \retval     core processor configuration information
*/
uint32_t syscfg_cpu1_config_info_get(void)
{
    return (uint32_t)(SYSCFG_CP1CFGINF2 & BITS(0, 4));
}

#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

#if defined (GD32A72XX) || defined (GD32A74XX)
/*!
    \brief      get interrupt router interrupt flag, API ID: 0x0031
    \param[in]  core_num
                only one parameter can be selected which are shown as below:
      \arg        CM7_0: Cortex-M7 core 0
      \arg        CM7_1: Cortex-M7 core 1
    \param[in]  ir_cp_int
                only one parameter can be selected which are shown as below:
      \arg        INTROUTER_CP_INT_0: interrupt router core processer interrupt 0
      \arg        INTROUTER_CP_INT_1: interrupt router core processer interrupt 1
      \arg        INTROUTER_CP_INT_2: interrupt router core processer interrupt 2
      \arg        INTROUTER_CP_INT_3: interrupt router core processer interrupt 3
    \param[in]  int_flag
                only one parameter can be selected which are shown as below:
      \arg        INTROUTER_CP_INT_FLAG_CP1_CP0: CP1 to CP0 interrupt flag
      \arg        INTROUTER_CP_INT_FLAG_CP0_CP0: CP0 to CP0 interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus syscfg_interrupt_router_interrupt_flag_get(uint8_t core_num, uint32_t ir_cp_int, uint32_t int_flag)
{
    FlagStatus reval = RESET;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_CM7_NUM(core_num)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(48), ERR_PARAM_INVALID);
    } else if(NOT_IR_CP_INT(ir_cp_int)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(48), ERR_PARAM_INVALID);
    } else if(NOT_IR_CP_INT_FLAG(int_flag)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(48), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(CM7_0 == core_num) {
            /* CM7_0 interrupt router */
            if(0U != (REG32(SYSCFG + 0x00000300U + (uint32_t)(ir_cp_int * 0x08U)) & int_flag)) {
                reval = SET;
            } else {
                /* this code is written to avoid MISRA 15.7 (no 'else' at end of 'if ... else if' chain) */
            }
        } else {
            /* CM7_1 interrupt router */
            if(0U != (REG32(SYSCFG + 0x00000320U + (uint32_t)(ir_cp_int * 0x08U)) & int_flag)) {
                reval = SET;
            } else {
                /* this code is written to avoid MISRA 15.7 (no 'else' at end of 'if ... else if' chain) */
            }
        }
    }
    return reval;
}

/*!
    \brief      clear interrupt router interrupt flag, API ID: 0x0032
    \param[in]  core_num
                only one parameter can be selected which are shown as below:
      \arg        CM7_0: Cortex-M7 core 0
      \arg        CM7_1: Cortex-M7 core 1
    \param[in]  ir_cp_int
                only one parameter can be selected which are shown as below:
      \arg        INTROUTER_CP_INT_0: interrupt router core processer interrupt 0
      \arg        INTROUTER_CP_INT_1: interrupt router core processer interrupt 1
      \arg        INTROUTER_CP_INT_2: interrupt router core processer interrupt 2
      \arg        INTROUTER_CP_INT_3: interrupt router core processer interrupt 3
    \param[in]  int_flag
                only one parameter can be selected which are shown as below:
      \arg        INTROUTER_CP_INT_FLAG_CP1_CP0: CP1 to CP0 interrupt flag
      \arg        INTROUTER_CP_INT_FLAG_CP0_CP0: CP0 to CP0 interrupt flag
    \param[out] none
    \retval     none
*/
void syscfg_interrupt_router_interrupt_flag_clear(uint8_t core_num, uint32_t ir_cp_int, uint32_t int_flag)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_CM7_NUM(core_num)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(50), ERR_PARAM_INVALID);
    } else if(NOT_IR_CP_INT(ir_cp_int)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(50), ERR_PARAM_INVALID);
    } else if(NOT_IR_CP_INT_FLAG(int_flag)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(50), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(CM7_0 == core_num) {
            /* CM7_0 interrupt router */
            REG32(SYSCFG + 0x00000300U + (uint32_t)(ir_cp_int * 0x08U)) |= int_flag;
        } else {
            /* CM7_1 interrupt router */
            REG32(SYSCFG + 0x00000320U + (uint32_t)(ir_cp_int * 0x08U)) |= int_flag;
        }
    }
}
#endif /* defined (GD32A72XX) || defined (GD32A74XX) */

/*!
    \brief      get TMR error interrupt flag, API ID: 0x0033
    \param[in]  tmrerr_intflag
                only one parameter can be selected which are shown as below:
      \arg        TMRERR_INT_FLAG_FMUNMI: TMR fault interrupt flag of the FMU NMI interrupt flag enable
      \arg        TMRERR_INT_FLAG_CPEN: TMR fault interrupt flag of the CPU released
      \arg        TMRERR_INT_FLAG_MEMEXECR: TMR fault interrupt flag of the memory execution control register
      \arg        TMRERR_INT_FLAG_CPINT: TMR fault interrupt flag of the interrupt router CPn interrupt status register
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus syscfg_tmr_error_flag_get(uint32_t tmrerr_intflag)
{
    FlagStatus reval = RESET;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TMRERR_INT_FLAG(tmrerr_intflag)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(49), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(0U != (SYSCFG_TMRFCS & tmrerr_intflag)) {
            reval = SET;
        } else {
            /* this code is written to avoid MISRA 15.7 (no 'else' at end of 'if ... else if' chain) */
        }
    }
    return reval;
}

/*!
    \brief      clear SYSCFG CPU flag, API ID: 0x0034
    \param[in]  nmi_flag
                only one parameter can be selected which are shown as below:
      \arg        SYSCFG_FLAG_CKMNMIERR: HXTAL clock monitor NMI error flag
      \arg        SYSCFG_FLAG_CPU0_WR_ABORT: CPU0 write abort on AHB slave flag
      \arg        SYSCFG_FLAG_CPU1_WR_ABORT: CPU1 write abort on AHB slave flag
    \param[out] none
    \retval     none
*/
void syscfg_cpu_flag_clear(uint32_t nmi_flag)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_NMI_CLEAR_FLAG(nmi_flag)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(51), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch(nmi_flag) {
        case SYSCFG_FLAG_CKMNMIERR:
            /* clear CKMNMIERR flag in SYSCFG_STAT register */
            SYSCFG_STAT |= SYSCFG_STAT_CKMNMIIF;
            break;
        case SYSCFG_FLAG_CPU0_WR_ABORT:
            /* clear WAS flag in SYSCFG_CPU0CS register */
            SYSCFG_CPU0CS |= SYSCFG_CPU0CS_WAS;
            break;
        default:
#if defined (GD32A72XX) || defined (GD32A74XX)
            /* clear WAS flag in SYSCFG_CPU1CS register */
            SYSCFG_CPU1CS |= SYSCFG_CPU1CS_WAS;
#endif /* defined (GD32A72XX) || defined (GD32A74XX) */
            break;
        }
    }
}

/*!
    \brief      clear TMR error interrupt flag, API ID: 0x0035
    \param[in]  tmrerr_intflag
                one or more parameters can be selected which are shown as below:
      \arg        TMRERR_INT_FLAG_FMUNMI: TMR fault interrupt flag of the FMU NMI interrupt flag enable
      \arg        TMRERR_INT_FLAG_CPEN: TMR fault interrupt flag of the CPU released
      \arg        TMRERR_INT_FLAG_MEMEXECR: TMR fault interrupt flag of the memory execution control register
      \arg        TMRERR_INT_FLAG_CPINT: TMR fault interrupt flag of the interrupt router CPn interrupt status register
    \param[out] none
    \retval     none
*/
void syscfg_tmr_error_int_flag_clear(uint32_t tmrerr_intflag)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_TMRERR_INT_FLAG(tmrerr_intflag)) {
        fw_debug_report_err(SYSCFG_MODULE_ID, API_ID(52), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        SYSCFG_TMRFCS |= tmrerr_intflag;
    }
}
